# PostPattern Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PostPattern Properties
PostPattern Class See Also
---
The PostPattern type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CornerPost | Accesses the object containing properties related to the corner post. |
| CornerPostAngle | The angle between neighboring railing segments which conditions inserting post along a railing path. |
| CornerPostCondition | The condition which controls the insertion of corner posts. |
| EndPost | Accesses the object containing properties related to the end post. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| StartPost | Accesses the object containing properties related to the start post. |

# See Also
PostPattern Class
Autodesk.Revit.DB.Architecture Namespace